Autodesk.Revit.DB.ViewportPositioning
Since:
2023
An enumerated type listing of viewport positioning options on the sheet when swapped to another view.
Since:
2023

Autodesk.Revit.DB.ViewportPositioning.ViewOrigin
When swapping to another view, the viewport location will be based on the view origin.

Autodesk.Revit.DB.ViewportPositioning.ViewportCenter
When swapping to another view, the center of the viewport will be maintained.